<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of DataGrip.
        url for x86: https://www.jetbrains.com/datagrip/download/download-thanks.html?platform=mac
	url for arm64: https://www.jetbrains.com/datagrip/download/download-thanks.html?platform=macM1
    </string>
	<key>Identifier</key>
	<string>com.github.advisoryteam.download.DataGrip</string>
	<key>Input</key>
	<dict>
	    <key>NAME</key>
	    <string>DataGrip</string>
	    <key>url</key>
	    <string>https://www.jetbrains.com/datagrip/download/download-thanks.html?platform=mac</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
	    <dict>
		<key>Processor</key>
		<string>URLDownloader</string>
		<key>Arguments</key>
		<dict>
		    <key>filename</key>
		    <string>%NAME%.dmg</string>
		    <key>url</key>
		    <string>%url%</string>
		</dict>
	    </dict>
	    <dict>
		<key>Processor</key>
		<string>EndOfCheckPhase</string>
	    </dict>
	    <dict>
	    <key>Arguments</key>
	    <dict>
		<key>input_path</key>
		<string>%pathname%/DataGrip.app</string>
		<key>requirement</key>
		<string>identifier "com.jetbrains.datagrip" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2ZEFAR8TH3"</string>
	    </dict>
	    <key>Processor</key>
	    <string>CodeSignatureVerifier</string>
	</dict>
    </array>
</dict>
</plist>
