<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Endpoint Security for Mac and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.advisoryteam.munki.BitDefender</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/BitDefender</string>
		<key>NAME</key>
		<string>BitDefender</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>SecurityNetworkInstallerApp.app</string>
				<string>Endpoint Security for Mac.app</string>
				<string>BDLDaemon.app</string>
				<string>EndpointSecurityforMac.app</string>
				<string>EndpointSecurityforMacUninstaller.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>Production</string>
			</array>
			<key>description</key>
			<string>BitDefender helps secure your workstation by adding prevention, detection, and response technology on top of your operating system. Sophos Endpoint Protection is designed for workstations running Windows and macOS.</string>
			<key>developer</key>
			<string>Bitdefender SRL</string>
			<key>display_name</key>
			<string>BitDefender</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.advisoryteam.download.BitDefender</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
