<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Adobe's Creative Cloud Desktop App Installer.
	Set the ARCHITECTURE override to "osx10" to download the Intel or "macarm64" for Apple Silicon.</string>
	<key>Identifier</key>
	<string>com.github.advisoryteam.munki.AdobeCreativeCloud</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Adobe Creative Cloud Installer</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Adobe/CC</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>Production</string>
			</array>
			<key>description</key>
			<string>Adobe Creative Cloud for Mac.</string>
			<key>display_name</key>
			<string>Adobe Creative Cloud Installer</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>minimum_os_version</key>
			<string>10.6</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.advisoryteam.download.AdobeCreativeCloud</string>
	<key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>