<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of ExpressVPN and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.advisoryteam.munki.ExpressVPN</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>ExpressVPN</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>ExpressVPN IKEv2.app</string>
				<string>ExpressVPN.app</string>
				<string>ExpressVPN Launcher.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>Production</string>
			</array>
			<key>category</key>
			<string>Third Party Apps</string>
			<key>description</key>
			<string> </string>
			<key>developer</key>
			<string>ExprsVPN LLC</string>
			<key>display_name</key>
			<string>ExpressVPN</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>preinstall_script</key>
			<string>#!/bin/bash
			
sudo launchctl unload /Library/LaunchDaemons/com.expressvpn.expressvpnd.plist
</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.advisoryteam.download.ExpressVPN</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
