<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of LsAgent and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.advisoryteam.munki.LsAgent</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>LsAgent-osx</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Lansweeper</string>
		<key>NAME</key>
		<string>LsAgent</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string> </string>
			</array>
			<key>catalogs</key>
			<array>
				<string>Production</string>
			</array>
			<key>category</key>
			<string>Third Party Apps</string>
			<key>description</key>
			<string> </string>
			<key>developer</key>
			<string>Lansweeper NV</string>
			<key>display_name</key>
			<string>Lansweeper Agent</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.advisoryteam.download.LsAgent</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
